#include <iostream>
using namespace std;
int main()
{

}

// 
// 절차지향 프로그래밍은 빠름
// 
// 인스턴스 -> 메모리에 잡혀있는 상태
// 
// 추상화 -> 누구나 알 법한 것들로 표현하는 것(추출하는 것)
// 
// 객체지향 언어는 추상화다.
// 
// 클래스 생성시 이름은 C로 시작.
// 
// 클래스 메모리 크기는 구조체 계산할때와 같다.
// 
// 접근 제어 지시자?: private, protected(상속관계), public
// 
// 멤버함수를 선언할 때 외부에서 몸체를 완성할 때는 CObj:: 연산자를 사용해야 함. 이후에는 private 접근 가능 -> 헤더파일, cpp파일 사용할 때
// 
// 은닉화때문에 기본값이 private임.
// 
// 보편적으로 멤버변수는 private, 멤버함수는 public으로 사용함.
// 
// 하나의 함수에서는 하나의 역할만 할 수 있게 해야 함.(관습) 
// 
// 멤버변수 만들 때마다 access method를 모든 멤버 변수별로 만들어야 함.
// 
// 숙제 -> 추가기능을 만들 수 있어야 함!
// 
